nix-build.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-23 Tue 11:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>nix-build</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">nix-build</h1>
<p>
building a nix package is pretty simple, however the process seems
under-documented
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. building a package in the nixpkgs tree</a></li>
<li><a href="#org0000001">2. building a maintainer's packages</a></li>
<li><a href="#org0000002">3. building a nix file with a channel</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> building a package in the nixpkgs tree</h2>
<div class="outline-text-2" id="text-1">
<p>
assuming you are at the root of the nixpkgs tree, you can use the <code>-A</code>
option to choose a package to build
</p>
<pre class="example" id="org0000003">
nix-build . -A xcd
</pre>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> building a maintainer's packages</h2>
<div class="outline-text-2" id="text-2">
<p>
nixpkgs also includes a fancy convenience script for building all of a
maintainer's packages at once
</p>
<pre class="example" id="org0000003">
nix-build maintainers/scripts/build.nix --argstr maintainer xfnw
</pre>
</div>
</div>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">3.</span> building a nix file with a channel</h2>
<div class="outline-text-2" id="text-3">
<pre class="example" id="org0000003">
nix-build -E "with import &lt;nixpkgs&gt; {}; callPackage ./default.nix {}"
</pre>

<p>
though with special types of packages, such as python ones, additional
stuff needs to be pulled into scope
</p>
<pre class="example" id="org0000003">
nix-build -E "with import &lt;nixpkgs&gt; {}; with python3Packages; callPackage ./default.nix {}"
</pre>
</div>
</div>
</div>
</body>
</html>
